// /** @file
//
// Copyright (c) 2010 - 2016, Byosoft Corporation.<BR>
// All rights reserved.This software and associated documentation (if any)
// is furnished under a license and may only be used or copied in
// accordance with the terms of the license. Except as permitted by such
// license, no part of this software or documentation may be reproduced,
// stored in a retrieval system, or transmitted in any form or by any
// means without the express written consent of Byosoft Corporation.
//
// File Name:
//
// Abstract:
//   Platform configuration setup.
//
// Revision History:
//
//
// **/
/=#
#langdef   en-US "English"
#langdef   zh-Hans "\wide中文\narrow"

// Security
#string FORMSET_TITLE_SECURITY          #language en-US "Security"
                                        #language zh-Hans "\wide安全\narrow"
#string FORMSET_TITLE_SECURITY_HELP     #language en-US "Security Settings"
                                        #language zh-Hans "\wide安全配置\narrow"
#string STR_SET_PASSWORD                #language en-US "Password Setting Successfully"
                                        #language zh-Hans "\wide密码设置成功\narrow"
#string STR_CLEAR_PD                    #language en-US "Password deleted succeeded"
                                        #language zh-Hans "\wide密码删除成功\narrow"
#string STR_EMPTY                       #language en-US   "" 
                                        #language zh-Hans ""
#string STR_SECUREBOOT_TITLE            #language en-US "Secure Boot"
                                        #language zh-Hans "\wide安全启动\narrow"
#string STR_SECUREBOOT_HELP             #language en-US "Secure boot settings, include enable/disable function and remove/restore keys." 
                                        #language zh-Hans "\wide安全启动设定，包括打开\narrow/\wide关闭此功能，以及移除\narrow/\wide恢复证书。\narrow"                                        
#string STR_PASSWORD_INSTALLED          #language en-US "Installed"
                                        #language zh-Hans "\wide已安装\narrow"
#string STR_PASSWORD_UNINSTALLED        #language en-US "Not Installed"
                                        #language zh-Hans "\wide未设定\narrow"
#string STR_ADMIN_PASSWORD              #language en-US "Set Administrator Password"
                                        #language zh-Hans "\wide设置管理员密码\narrow"
#string STR_SET_ADMIN_PASSWORD          #language en-US "Set Administrator Password"
                                        #language zh-Hans "\wide设置管理员密码\narrow"
#string STR_ADMIN_PASSWORD_HELP         #language en-US "Select this item to set, change, or delete Administrator Password. a-z, 0-9 and special printable character are supported. Passwords are case sensitive. The limited length of password string is 8 to 20.\n\nNOTE:\nTo delete Password, enter blank when input new password. Passwords need to contain upper and lower case letters, numbers and special symbols. The modified password cannot be the same as the previous five passwords. Delete user Password at the same time when Administrator Removed.  System will wait 60~180 seconds when try more 3 times, and then try again."
                                        #language zh-Hans "\wide选择这一项来设定、更改以及删除管理员密码。密码支持字符包括字母、数字以及其它可打印字符。密码区分大小写，支持输入密码长度为\narrow8\wide到\narrow20\wide。\narrow\n\n\wide注意\narrow:\n\wide输入密码时按\narrowEnter\wide键输入空可以删除密码。密码中需要包含大小写字母、数字以及特殊符号。修改后的密码不能与前五次密码相同。删除管理员密码会同时删除用户密码。校验密码错误\narrow3\wide次，需要等待\narrow60\wide到\narrow180\wide秒后重新输入。\narrow"
#string STR_USER_PASSWORD               #language en-US "Set User Password"
                                        #language zh-Hans "\wide设置用户密码\narrow"
#string STR_SET_USER_PASSWORD           #language en-US "Set User Password"
                                        #language zh-Hans "\wide设置用户密码\narrow"

#string STR_USER_PASSWORD_HELP          #language en-US "Select this item to set, change, or delete User Password. a-z, 0-9 and special printable character are supported. Passwords are case sensitive. The limited length of password string is 8 to 20.\n\nNOTE:\nTo delete Password, enter blank when input new password. Passwords need to contain upper and lower case letters, numbers and special symbols. The modified password cannot be the same as the previous five passwords. System will wait 60~180 seconds when try more 3 times, and then try again."
                                        #language zh-Hans "\wide选择这一项来设定、更改以及删除用户密码。密码支持字符包括字母、数字以及其它可打印字符。密码区分大小写，支持输入密码长度为\narrow8\wide到\narrow20\wide。\narrow\n\n\wide注意\narrow:\n\wide输入密码时按\narrowEnter\wide键输入空可以删除密码。密码中需要包含大小写字母、数字以及特殊符号。修改后的密码不能与前五次密码相同。校验密码错误\narrow3\wide次，需要等待\narrow60\wide到\narrow180\wide秒后重新输入。\narrow"

#string STR_POP_ON_RESTART              #language en-US  "Power-on Password"
                                        #language zh-Hans "\wide开机密码\narrow"
#string STR_POP_ON_RESTART_HELP         #language en-US  "Select whether to turn on Power-on Password."
                                        #language zh-Hans "\wide选择是否开启开机密码功能。\narrow"
#string STR_CHANGE_POP_BY_USER          #language en-US  "POP Changeable by User"
                                        #language zh-Hans "\wide允许更改用户密码\narrow"
#string STR_CHANGE_POP_BY_USER_HELP     #language en-US  "The User Password can be locked by Adiministrator."
                                        #language zh-Hans "\wide用户密码可以被管理员锁住。\narrow"
#string STR_CLEAR_USER_PASSWORD         #language en-US "Clear Pop Password"
                                        #language zh-Hans "\wide清除用户密码\narrow"
#string STR_CLEAR_USER_PASSWORD_HELP    #language en-US "Set Pop Password to Empty."
                                        #language zh-Hans "\wide清空用户密码。\narrow"

#string STR_HDD_SECURITY_CONFIG         #language en-US   "Hard Disk Password"
                                        #language zh-Hans "\wide硬盘密码\narrow"
#string STR_HDD_SECURITY_CONFIG_HELP    #language en-US   "Set/Clear Hard Disk Password."
                                        #language zh-Hans "\wide设置或清除硬盘密码。\narrow"

#string STR_ENTER_CORRECT_PD            #language en-US   "Passwords need to contain upper and lower case letters, numbers, and special symbols."
                                        #language zh-Hans "\wide密码中需要包含大小写字母、数字以及特殊符号。\narrow"
#string STR_PASSWORD_TIMES              #language en-US   "Password has been used by the latest 5 times!"
                                        #language zh-Hans "\wide修改后的密码不能与前五次密码相同！\narrow"
#string STR_CONFIRM_ERROR               #language en-US "Password Error!"
                                        #language zh-Hans "\wide密码错误！\narrow"

#string STR_CONFIRM_RULE_ERROR               #language en-US "Password Rule Error!"
                                        #language zh-Hans "\wide不符合密码安全性要求！\narrow"

#string STR_SET_PASSWORD_VALID_DAYS         #language en-US   "Set Password Valid Days"
                                            #language zh-Hans "\wide设置密码有效期\narrow"
#string STR_SET_PASSWORD_VALID_DAYS_HELP    #language en-US   "Set Password Valid Days."
                                            #language zh-Hans "\wide设置密码有效期。\narrow"
#string STR_SEVEN_DAYS                      #language en-US   "7 Days"
                                            #language zh-Hans "7\wide天\narrow"
#string STR_THIRTY_DAYS                     #language en-US   "30 Days"
                                            #language zh-Hans "30\wide天\narrow"
#string STR_ZERO_DAYS                     #language en-US   "Indefinite"
                                            #language zh-Hans "\wide无限期\narrow"
#string STR_RESET_TIME                      #language en-US   "Password Lock Time"
                                            #language zh-Hans "\wide密码锁定时间\narrow"
#string STR_RESET_TIME_HELP                 #language en-US   "The number of seconds to wait for the next input after entering the wrong password 3 times. Valid range is from 60s to 180s."
                                            #language zh-Hans "\wide输错\narrow3\wide次密码后等待下次输入的秒数。范围是\narrow60\wide秒到\narrow180\wide秒。\narrow"

#string STR_ADMIN_FIRST                     #language zh-Hans  "\wide请先设置管理员密码\narrow" 
                                            #language en-US    "Please set Administrator Password first" 
											
#string STR_USER_PASSWORD_CANNOT_DELETE     #language zh-Hans  "\wide用户权限不能删除密码\narrow" 
                                            #language en-US    "User Rights Cannot Delete Password" 
